app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order("updated_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY updated_at DESC

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "qerfqwrfw"], ["created_at", 2017-01-12 10:24:44 UTC], ["updated_at", 2017-01-12 10:24:44 UTC]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?